app/services/appointment_creator.rb

  def validate_appointment_already_exists
    # #need to check if the appointment is already booked by the current user in same date as @slot.start_at
    if current_user.appointments.joins(:slot).exists?(slots: { start_at: slot.start_at.beginning_of_day..slot.end_at.end_of_day })
---
SELECT 1 AS one FROM "appointments" INNER JOIN "slots" ON "slots"."id" = "appointments"."slot_id" WHERE "appointments"."user_id" = $1 AND "slots"."start_at" BETWEEN $2 AND $3 LIMIT $4  [["user_id", 3], ["start_at", "2026-02-06 18:30:00"], ["start_at", "2026-02-07 18:29:59.999999"], ["LIMIT", 1]]

  def validate_duplicate_appointment
    if slot.appointment.present?
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."slot_id" = $1 LIMIT $2  [["slot_id", 1], ["LIMIT", 1]]