app/components/home_page/client_component.rb

SELECT "appointments".* FROM "appointments" INNER JOIN "slots" ON "slots"."id" = "appointments"."slot_id" WHERE "appointments"."user_id" = $1 AND "slots"."start_at" BETWEEN $2 AND $3 ORDER BY "appointments"."id" ASC LIMIT $4  [["user_id", 7], ["start_at", "2026-02-03 18:30:00"], ["start_at", "2026-02-04 18:29:59.999999"], ["LIMIT", 1]]
---
  def initialize(current_user: nil, selected_slot_id: nil)
    @current_user = current_user
    @calendar = current_user.calendar
    @selected_slot_id = selected_slot_id
    @appointment = current_user.appointments
                                .joins(:slot)
                                .includes(publisher: :user_profile)
                                .where("slots.start_at >= ?", next_day)
                                .order("slots.start_at ASC")
                                .first

SELECT "slots".* FROM "slots" WHERE "slots"."start_at" BETWEEN $1 AND $2 AND "slots"."status" = $3 AND "slots"."status" = $4 ORDER BY "slots"."start_at" ASC  [["start_at", "2026-02-04 18:30:00"], ["start_at", "2026-02-05 18:29:59.999999"], ["status", 1], ["status", 1]]
SELECT "slots".* FROM "slots" WHERE "slots"."start_at" BETWEEN $1 AND $2 AND "slots"."status" = $3 AND "slots"."status" = $4 ORDER BY "slots"."start_at" ASC  [["start_at", "2026-02-06 18:30:00"], ["start_at", "2026-02-07 18:29:59.999999"], ["status", 1], ["status", 1]]
---
  def next_day_available_slots
    slots = Slot.where(start_at: next_day.beginning_of_day..next_day.end_of_day)
                    .where(status: :available).available
                    .order(start_at: :asc)
    slots.map { |slot| { time: slot.start_at.strftime("%I:%M %p"), id: slot.id } }

SELECT "appointments".* FROM "appointments" WHERE "appointments"."slot_id" = $1 LIMIT $2  [["slot_id", 2], ["LIMIT", 1]]
SELECT "slots".* FROM "slots" WHERE "slots"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def appointment_created?(slot_id)
    slot = Slot.find_by(id: slot_id)
    slot.present? && slot.appointment.present?