app/controllers/appointments_controller.rb

def has_joined
  @appointment.update_joined_status
---
UPDATE "appointments" SET "updated_at" = $1, "subscriber_joined" = $2 WHERE "appointments"."id" = $3  [["updated_at", "2026-02-07 16:08:54.095507"], ["subscriber_joined", true], ["id", 1]]

def edit
  @appointment = current_user.appointments.find(params[:id])
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."user_id" = $1 AND "appointments"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]

def reshedule
  new_slot = Slot.find_by(id: appointment_params[:reschedule_selected_slot_id])
---
SELECT "slots".* FROM "slots" WHERE "slots"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

def set_slot
  @slot = Slot.find(appointment_params[:slot_id])
---
SELECT "slots".* FROM "slots" WHERE "slots"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

def set_appointment
  @appointment = current_user.appointments.find(params[:id])
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."user_id" = $1 AND "appointments"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]