app/controllers/call_rooms_controller.rb

  def create
    session_creator = CallRoomSessionCreator.new(appointment: @appointment)
    ActiveRecord::Base.transaction do
     @call_room = @appointment.create_call_room
     raise ActiveRecord::Rollback unless session_creator.create
    end

    # @call_room.name = "#{@appointment.publisher.user_profile.first_name} - #{@appointment.subscriber.user_profile.first_name}"
    if @call_room.persisted?
      redirect_to appointment_call_room_path(@appointment, @call_room), notice: "Call room was successfully created."
    else

      render turbo_stream: turbo_stream.update("flash_messages", partial: "shared/alert", locals: { message: [ @call_room.errors.full_messages, session_creator.error_message ].flatten.join(", ") })
---
INSERT INTO "call_rooms" ("name", "vonage_session_id", "appointment_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
SELECT "call_rooms".* FROM "call_rooms" WHERE "call_rooms"."appointment_id" = $1 LIMIT $2  [["appointment_id", 1], ["LIMIT", 1]]

  def set_call_room
    @call_room = CallRoom.find(params[:id])
---
SELECT "call_rooms".* FROM "call_rooms" WHERE "call_rooms"."id" = $1 LIMIT $2  [["id", 40], ["LIMIT", 1]]

  def set_appointment
    @appointment = Appointment.find(params[:appointment_id])
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]