app/controllers/registrations_controller.rb

INSERT INTO "users" ("email_address", "password_digest", "created_at", "updated_at", "uid", "provider") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["email_address", "[FILTERED]"], ["password_digest", "[FILTERED]"], ["created_at", "2026-01-11 15:59:08.134596"], ["updated_at", "2026-01-11 15:59:08.134596"], ["uid", nil], ["provider", nil]]
---
  def create
    @user = User.new(user_params)

    if @user.save