app/controllers/schedules_controller.rb

SELECT "calendars".* FROM "calendars" WHERE "calendars"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def set_calendar
    @calendar = Calendar.find(params[:calendar_id])