app/controllers/sessions_controller.rb

  def omniauth
    auth = request.env['omniauth.auth']

    # Find or create user by email (since email_address is unique)
    @user = User.find_or_create_by(email_address: auth['info']['email']) do |u|
---
SELECT "users".* FROM "users" WHERE "users"."email_address" = $1 LIMIT $2  [["email_address", "[FILTERED]"], ["LIMIT", 1]]