app/models/call_room.rb

  def set_name
    return if name.present?
    self.name = "#{appointment.publisher.user_profile.first_name} - #{appointment.subscriber.user_profile.first_name}"
---
SELECT "user_profiles".* FROM "user_profiles" WHERE "user_profiles"."user_id" = $1 LIMIT $2  [["user_id", 2], ["LIMIT", 1]]