app/models/role_configuration.rb

  def activate_permissions(ability, user)
    # roles = ['default'] | user.spree_roles.map(&:name)
    roles = [ "default" ]
    roles += user.roles.map(&:name) if user
---
SELECT "roles".* FROM "roles" INNER JOIN "role_users" ON "roles"."id" = "role_users"."role_id" WHERE "role_users"."user_id" = $1  [["user_id", 3]]