app/models/user.rb

SELECT "roles".* FROM "roles" WHERE "roles"."name" = $1 LIMIT $2  [["name", "Client"], ["LIMIT", 1]]
---
  def set_default_role
    role = Role.find_by(name: "Client")