app/jobs/PostCallHeartBeatJob.rb

SELECT "slots".* FROM "slots" WHERE "slots"."id" IN ($1, $2)  [["id", 1], ["id", 2]]
---
  def perform
     all_appointments = Appointment.includes(:slot).pending_or_in_progress_or_completed_or_booked

     all_appointments.each do |appointment|

UPDATE "appointments" SET "updated_at" = $1, "status" = $2 WHERE "appointments"."id" = $3  [["updated_at", "2026-02-07 18:05:00.289652"], ["status", 3], ["id", 1]]
UPDATE "appointments" SET "updated_at" = $1, "status" = $2 WHERE "appointments"."id" = $3  [["updated_at", "2026-02-07 16:14:59.988502"], ["status", 5], ["id", 1]]
UPDATE "appointments" SET "updated_at" = $1, "status" = $2 WHERE "appointments"."id" = $3  [["updated_at", "2026-02-07 10:50:10.509095"], ["status", 1], ["id", 2]]
---
  def updated_appointment_status(appointment)
    return if appointment.slot.nil? ||  Time.now < appointment.start_at
    if appointment.booked? &&  Time.now  > appointment.end_at
      appointment.update(status: :completed)
    elsif in_progress?(appointment) && appointment.publisher_or_subscriber_joined?
      appointment.update(status: :in_progress)
    elsif both_joined?(appointment)
      appointment.update(status: :completed)